content/tools/ts-code.md
---
title: "Selected topics on programming"
author: ["admin"]
date: 2021-01-14
lastmod: 2021-01-14T22:49:54+01:00
tags: ["tech-seminar"]
categories: ["tools"]
draft: true
summary: Resources compilation and seminar materials on programming.
---

## Learning python {#learning-python}

There are online courses -- see [EdX](https://edx.org), [Coursera](https://coursera.org), [Udemy](https://udemy.com), [Stepik](https://stepik.org), and such.
Different people will like different courses, but I could mention:

-   [Programming for Everybody / Getting Started with Python](https://www.coursera.org/learn/python) from U. Michigan
    (Coursera), for a more general intro.
-   [Python for Research](https://www.edx.org/course/using-python-for-research) from Harvard (EdX)


### <span class="org-todo todo TODO">TODO</span> Overviews {#overviews}


### <span class="org-todo todo TODO">TODO</span> Books {#books}


### <span class="org-todo todo TODO">TODO</span> Kaggles, maybe? {#kaggles-maybe}
